# title       : Регрессионный анализ, часть 1
# subtitle    : Математические методы в зоологии - на R, осень 2013
# author      : Марина Варфоломеева
# job         : Каф. Зоологии беспозвоночных, СПбГУ
# ----------------СОДЕРЖАНИЕ-----------------------------------
# - Модель простой линейной регрессии
# - Проверка валидности модели (t- и F-критерии)
# - Условия применимости
# - Мощность линейной регрессии

# Пример: усыхающие личинки мучных хрущаков
# =========================================================
#   
# Как зависит потеря влаги личинками малого мучного хрущака _Tribolium confusum_ от влажности воздуха? (Nelson, 1964)
# 9 экспериментов, продолжительность 6 дней
# - разная относительная влажность воздуха, % (`humidity`)
# - измерена потеря влаги, мг (`weightloss`)
# 
# Данные в файлах `nelson.xlsx` и `nelson.csv`

# Читаем данные из файла и знакомимся с ними
# =========================================================
# Внимание, установите рабочую директорию, или используйте полный путь к файлу
setwd("C:\\mathmethr\week2")
## из .xlsx
library(XLConnect)
wb <- loadWorkbook(".\data\nelson.xlsx")
nelson <- readWorksheet(wb, sheet = 1)
## или из .csv 
# nelson <- read.table(file=".\data\nelson.xlsx", header = TRUE, sep = "\t", dec = ".") 

str(nelson)
head(nelson)

#   Как зависит потеря веса от влажности? График рассеяния.
# ========================================================
library(ggplot2)
p_nelson <- ggplot(data=nelson, aes(x = humidity, y = weightloss)) + 
  geom_point() + 
  labs(x = "Относительная влажность, %", y = "Потеря веса, мг")
p_nelson

# Внешний вид графиков можно менять при помощи тем
# ========================================================
p_nelson + theme_classic()
p_nelson + theme_bw()
theme_set(theme_classic()) # устанавливаем понравившуюся тему до конца сессии

#   Подбираем параметры линейной модели
# ========================================================
nelson_lm <- lm(weightloss ~ humidity, nelson)
summary(nelson_lm)

#   Добавим линию регрессии на график
# ========================================================
p_nelson + geom_smooth(method = "lm")

# ########################################################
# Как вы думаете,
# ========================================================
#   что это за серая область вокруг линии регрессии?

p_nelson + geom_smooth(method = "lm")

# ########################################################

#   Неопределенность
# ========================================================
#   Находим доверительные интервалы коэффициентов
# ===================================================
# Вспомните, в выдаче summary(nelson_lm) были только оценки коэффициентов 
# и стандартные ошибки
# оценки коэффициентов отдельно
coef(nelson_lm)
# доверительные интервалы коэффициентов
confint(nelson_lm)

# Оценим, какова средняя потеря веса при заданной влажности 
# ===================================================
# __Нельзя давать оценки вне интервала значений $X$!__
# новые данные для предсказания значений
newdata <- data.frame(humidity = c(50, 100)) 
predict(nelson_lm, newdata, 
        interval = "confidence", se = TRUE) 
# доверительный интервал к среднему значению

#   Строим доверительную зону регрессии
# ===================================================
p_nelson + geom_smooth(method = "lm") + 
  ggtitle ("95% доверительная зона регрессии")
p_nelson + geom_smooth(method = "lm", level = 0.99) + 
  ggtitle ("99% доверительная зона регрессии")

# Неопределенность оценок предсказанных значений
# ===================================================
#   Предсказываем для новых значений
# ===================================================
#   - __Нельзя использовать для предсказаний вне интервала значений $X$!__
# 
# новые данные для предсказания значений, с доверительными интервалами
newdata <- data.frame(humidity = c(50, 100)) 
predict(nelson_lm, newdata, 
        interval = "prediction", se = TRUE)
# зона, в которой будут лежать 95% всех значений

#   Данные для доверительной области значений
# ===================================================
# предсказанные значения для исходных данных
predict(nelson_lm, interval = "prediction")
# объединим с исходными данными в новом датафрейме - для графиков
nelson_with_pred <- data.frame(nelson, predict(nelson_lm, interval = "prediction"))

#   Строим доверительную область значений и доверительный интервал
# ===================================================
p_nelson + geom_smooth(method = "lm", aes(fill = "Доверительный интервал"), alpha = 0.4) +
  geom_ribbon(data = nelson_with_pred, 
              aes(y = fit, ymin = lwr, ymax = upr, fill = "Доверительная область значений"), 
              alpha = 0.2) +
  scale_fill_manual('Интервалы', values = c('green', 'blue'))

#   Проверка валидности модели
# ========================================================
#   Проверка коэффициентов с помощью t-критерия есть в сводке модели
# ========================================================
summary(nelson_lm)
  
#   Проверяем валидность модели при помощи F-критерия
# ========================================================
nelson_aov <- aov(nelson_lm)
summary(nelson_aov)

# Условия применимости простой линейной регрессии и анализ остатков
# ======================================================== 


# ########################################################
#   Проверьте линейность связи, 
# ========================================================
#    постройте для этого график рассеяния
#  ggplot()
#  aes()
#  geom_point()
# 
# ########################################################
   
#    Для анализа остатков выделим нужные данные в новый датафрейм
#  ========================================================
 # library(ggplot2)
 nelson_diag <- fortify(nelson_lm)
 names(nelson_diag) # названия переменных

#  `.cooksd` - расстояние Кука  
#  `.fitted` - предсказанные значения  
#  `.resid` - остатки  
#  `.stdresid` - стандартизованные остатки
 
# ########################################################
#   Постройте график зависимости остатков от предиктора (относительная влажность),  
# ========================================================
#    используя данные для анализа остатков из `nelson_diag`
# names() 
# ggplot()
# aes()
# geom_point()
# ########################################################


# ########################################################
# Постройте график зависимости стандартизованных остатков от предсказанных значений
# ========================================================
# ggplot()
# aes()
# geom_point()
# ########################################################


#   График станет информативнее, если кое-что добавить
# ========================================================
ggplot(data = nelson_diag, aes(x = .fitted, y = .stdresid)) +
  geom_point(aes(size = .cooksd)) +          # расстояние Кука
  geom_smooth(method="loess", se = FALSE) +  # линия тренда
  geom_hline(yintercept = 0)                 # горизонтальная линия на уровне y = 0

# ########################################################
#   Какие выводы можно сделать по графику остатков?
# ========================================================
# ########################################################


#   Нормально-вероятностный график
# ========================================================
ggplot(nelson_diag, aes(sample = .stdresid)) + 
  geom_point(stat = "qq")
# На нормально-вероятностный график можно добавить линию
source(url("http://stat511.cwick.co.nz/code/stat_qqline.r"))
ggplot(nelson_diag, aes(sample = .stdresid)) + 
  geom_point(stat = "qq") + 
  stat_qqline()


# Мощность линейной регрессии 
# ========================================================
#   Величина эффекта из общих соображений
# ========================================================
library(pwr)
cohen.ES(test="f2",size="large")

# ########################################################
# Посчитайте 
# ======================================================
#   какой нужен объем выборки, чтобы с вероятностью 0.8 обнаружить умеренную зависимость при помощи простой линейной регрессии?
# cohen.ES()
# pwr.f2.test()
# ########################################################